{
  "basics": {
    "name": "Alex Sterling",
    "label": "Developer",
    "picture": "headshotweb.jpg",
    "email": "sterlingalex@gmail.com",
    "phone": "(330) 703 5397",
    "website": "",
    "summary": "Alex enjoys designing and developing high-performance full-featured web applications with an emphasis on following web standards to ensure high quality.  He has experience spanning the entire web stack and learning new languages, frameworks or technologies to get the job done perfectly.  Extensive knowledge of building PHP, Java and NodeJS backend data services to support applications comes paired with frontend JavaScript/Vue/HTML/CSS mastery.  With 9 years of experience building web applications and skills in PHP, Laravel, Java, NodeJS, JavaScript, VueJS, DotCMS, SQL, CSS, HTML5, Dev-Ops, Testing, Azure, Dedicated SQL Pools, Dynamics 365, RedShift, and more. Alex delivers powerful web solutions that are maintainable and durable.",
    "location": {
      "address": "153 Westgate Ave.",
      "postalCode": "44281",
      "city": "Wadsworth",
      "countryCode": "US",
      "region": ""
    },
    "profiles": [
      {
        "network": "github",
        "username": "fusty",
        "url": "http://github.com/fusty"
      },
      {
        "network": "bitbucket",
        "username": "alex_sterling",
        "url": "http://bitbucket.org/alex_sterling"
      }
    ]
  },
  "work": [
    {
      "company": "mDesign",
      "position": "Software Engineer II - Senior Data Engineer",
      "website": "https://mdesignhomedecor.com/",
      "startDate": "09-16-2019",
      "endDate": "Present",
      "summary": "Maintaining monolithic legacy PHP infrastructure.  Developing modular Laravel service application ecosystem to reduce dependence on legacy PHP infrastructure.  Developing AWS and Azure based cloud-infrastructure for ETL and data analytics.  Optimizing analytical SQL queries to minimize data reporting lag.  Spearheading the cross-functional collaboration and buy-in necessary to make company-spanning foundational reporting changes.",
      "highlights": [
        "Developed Data Warehouse for Big Data analytics alongside optimized CRUD app databases (OLAP and OLTP)",
        "Expanded SQL knowledge beyond MySQL/MariaDB mastery into Postgres (Redshift) and T-SQL mastery",
        "Optimized write performance for large datasets across multiple database technologies",
        "Gained fluent understanding of maintaining columnar databases that lack built-in uniqueness or primary keys",
        "Comfort with the Azure Data Factory platform and the Azure Portal",
        "Mastered upgrading Laravel Projects from long-obsolete versions to current versions",
        "Comfortable migrating terabytes of data between data sources, formats and platforms",
        "Mastery of Laravel's Job Queue scheduling and CLI Commands",
        "Developed exception reporting and system monitoring to ensure data integrity and platform uptime",
        "Developed novel reporting on massive E-Commerce presence spanning Amazon, Wal Mart, Target, eBay and more",
        "Developed novel reporting on Third Party Logistics",
        "Deep knowledge of supply chain logistics spanning Vendor Relationships, Warehouse Management Systems, Enterprise Resource Planning, Third Party Fulfillment and Enterprise Resource Planning",
        "Led discussions between IT and Business to unify terminology, align KPIs and produce repeatable metrics utilized across functional groups",
        "Fostered GIT best practices and enforced CI/CD in new and legacy projects alike",
        "Platform agnostic problem solving",
        "Platform agnostic troubleshooting",
        "Expanded Linux (CentOS, Ubuntu) fluency"
      ]
    },
    {
      "company": "Ethode LLC",
      "position": "Senior Web Developer",
      "website": "https://www.ethode.com",
      "startDate": "09-01-2015",
      "endDate": "09-15-2019",
      "summary": "Developed for an array of clients, codebases and programming paradigms, working for Ethode was a huge influence to increase Alex's depth in programming skills along with project architecture, dev-ops and systems administration.  The diverse needs of the clients taken on by Ethode taught important lessons in agile development, mixed-presence collaboration, business rule translation, expectation management and more.  Expertise in JavaScript (including AngularJS and especially VueJS frameworks), CSS (including preprocessors like LESS and SASS/SCSS as well as Bootstrap 3/4), Java (including Spring framework), Apache Webserver, Jenkins and more was developed over the past 2+ years.",
      "highlights": [
        "Vastly deeper experience and mastery with the Java CMS: DotCMS",
        "Java Application and Plugin development",
        "Integrating third party APIs",
        "Utilizing open source libraries extensively",
        "Mastery of the VueJS (and Vuex) JavaScript framework",
        "Experience with task runners and build tools such as Gulp, Browserify and Webpack",
        "Developed and maintained backend applications running on Java, PHP, and Node",
        "Developed and maintained frontend applications using Vanilla JS, VueJS, AngularJS, jQuery and LESS/SASS/SCSS",
        "Led sessions discussing and teaching emergent topics in web dev such as VueJS, SASS/SCSS, Laravel, JavaScript, FlexBox, SSL Certificates and more",
        "Automated deployment of web applications and webservices using Jenkins",
        "Automated testing of web applications using various acceptance testing frameworks (primarily NodeJS based)",
        "Deep familiarity with *nix server management including Centos, Debian, RHEL, Amazon Linux and others",
        "Emphasis on frequent customer contact and collaboration with product owners",
        "Large team Git repository managmeent",
        "Mixed-Presence Agnostic"
      ]
    },
    {
      "company": "University of Akron, Information and Technology Services",
      "position": "Senior Web Developer",
      "website": "http://www.uakron.edu",
      "startDate": "06-02-2013",
      "endDate": "08-14-2015",
      "summary": "As Senior Web Developer Alex was in charge of web application design and development.  All work was deployed on RedHat 6 servers running PHP 5.3 and developed on Ubuntu 12.04 systems.  Extensive experience with build tools allowed him to cover the entire stack (htaccess/folder permissions to front end design) excluding Apache server settings when building applications",
      "highlights": [
        "Mastery of debugging PHP, JavaScript, SQL queries, CSS, HTML, Apache Velocity and more",
        "Mastery of API interfacing (JavaScript, PHP, REST, SOAP etc.)",
        "Extensive DotCMS backend experience",
        "Extensive use of VI/VIM, SublimeText and PHPStorm",
        "Experience on Linux servers (Ubuntu 12.04 and RedHat 6)",
        "Extensive use of, and preference for, command line tools",
        "Constant use of GIT version control (GitHub and BitBucket via CLI)",
        "Small-Team GIT repository management",
        "2 years of OOP PHP development",
        "Experience following PHP PSRs 0-2",
        "Extensive Laravel 4 development (From small utilities to scalable applications)",
        "2 years of REST server design/implementation experience",
        "Constant use of Composer PHP package manager",
        "Extensive use of build tools (Gulp, CSS/JS Minifcation, CSS Autoprefixing, Markdown parsing etc.)",
        "Constant use of AJAX in applications",
        "Comfort using front-end libraries such as Bootstrap, Foundation, jQuery and jQueryUI/Mobile",
        "IE8+ cross-browser compatibility familiarity",
        "E-Mail cross-client compatibility familiarity",
        "SASS/LESS experience"
      ]
    },
    {
      "company": "Parking and Transportation Services, The University of Akron",
      "position": "Office Assistant",
      "website": "http://www.uakron.edu/parking",
      "startDate": "6-31-2009",
      "endDate": "6-02-2013",
      "summary": "Parking and Transportation Services manages all parking on the University of Akron's main campus.  This includes maintenance and manning of lots during special events on campus.  An office assistant maintains computer based records and systems used to perform the daily operations of the Parking office.  ",
      "highlights": [
        "Daily use of *NIX environments",
        "Maintenance and Development of PHP, Javascript and SQL based web content",
        "Maintenance of server-side Perl scripts",
        "Daily use of SQL console and query syntax",
        "Developed an automated PDF parking permit generator",
        "Distribution of messaging over twitter, facebook, email, listserves and web pages",
        "Creation of internal and public maps, promotions, flyers and posters for electronic and print publications.",
        "Developed an application to reserve shuttle service, invoice said service and notify shuttle coordinators of the requested service"
      ]
    },
    {
      "company": "LMS Surveying LTD.",
      "position": "Office Support",
      "website": "http://www.lmssurveying.com/",
      "startDate": "2-1-2008",
      "endDate": "8-1-2008",
      "summary": "LMS Surveying LTD. is a land surveying company focusing on plotting improvements to property for tax and sales purposes.",
      "highlights": [
        "Build a Microsoft Access database to store job information and organize the field crew",
        "Redesign website (no longer their current website)",
        "Learn AutoCAD drafting process for surface surveys"
      ]
    },
    {
      "company": "Digital Media Center, Johns Hopkins University",
      "position": "Front Desk Worker",
      "website": "http://digitalmedia.jhu.edu/",
      "startDate": "7-1-2006",
      "endDate": "1-31-2008",
      "summary": "The Digital Media Center is an advanced and specialized computer lab and equipment rental/borrowing facility.  The software on the computers ranges from 3D modeling/animation to Photoshop to ProTools.  The equipment facilitated the capture of media to be processed in the Digital Media Center.  A front desk worker would coach the patrons requesting assistance to the best of their ability as well as loaning equipment to patrons and training patrons on their use.",
      "highlights": [
        "Trained and coached college students on a variety of digital media software and projects.  Software included Adobe Creative Suite, Adobe Final Cut, Avid Suite, Microsoft Office, 3DS Max, and Maya 3D",
        "Opened and closed a 20+ station computer lab also specializing in the loaning out of audio-visual capture equipment and training on audio-visual equipment"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "The University of Akron",
      "area": "Computer Science",
      "studyType": "Incomplete Bachelors",
      "startDate": "2010-08",
      "endDate": "2017-08",
      "gpa": "",
      "courses": [
        "Object Oriented Programming (OOP Java)",
        "Data Structures",
        "Internet Systems Programming",
        "Introduction to C++",
        "Computer Science 2 (OOP C++)",
        "Discrete Mathematics",
        "Calculus III"
      ]
    },
    {
      "institution": "Johns Hopkins University",
      "area": "Mechanical Engineering",
      "studyType": "Incomplete Bachelors",
      "startDate": "2006-08",
      "endDate": "2008-01",
      "gpa": "",
      "courses": [
        "Thermodynamics",
        "Calculus II",
        "Statics"
      ]
    }
  ],
  "awards": [],
  "portfolio": [
    {
      "name": "WorldatWork Site",
      "publisher": "WorldatWork",
      "releaseDate": "January 2018",
      "website": "https://www.worldatwork.org",
      "summary": "Business site for WorldatWork, a global leader in human resources education specializing in compensation.  The site is built on DotCMS on top of numerous microservices as well as third party integrations.  Primary responsibilities were backend API development, migration systems development, VueJS frontend applications (account manipulation, registration, searching) and other content related items"
    },
    {
      "name": "MyPraize Social Media Platform",
      "publisher": "MyPraize",
      "releaseDate": "2017",
      "website": "https://www.mypraize.com",
      "summary": "A christian social media platform.  Primary responsibilities were improving the groups feature on the site."
    },
    {
      "name": "University of Akron Campus Map",
      "publisher": "University of Akron",
      "releaseDate": "September 2013",
      "website": "http://maps.uakron.edu",
      "summary": "Interactive campus map built on top of Google Maps API.  Includes driving/walking/biking directions, building information, deep-linking of building profiles all with a graphical backend for distributed management."
    },
    {
      "name": "University of Akron Email/Web Publication Tool",
      "publisher": "University of Akron",
      "releaseDate": "February 2015",
      "website": "http://share.uakron.edu/mailAll",
      "summary": "A universal publication and distribution CMS for campus use.  Allows the creation, moderation and distribution of publications organized by articles.  Allows reader submission of articles, custom front-end formatting, and fine-grained permissioning.  The application can scale to an arbitrary number of publications natively."
    },
    {
      "name": "University of Akron Google Search Appliance",
      "publisher": "University of Akron",
      "releaseDate": "June 2015",
      "website": "http://gsa.uakron.edu/",
      "summary": "Heavy XSLT modifications to the GSA so it looks like the rest of uakron.edu sites"
    }
  ],
  "skills": [
    {
      "name": "Data Engineer",
      "level": "Senior Engineer",
      "keywords": [
        "SQL 9yrs",
        "Analytical PHP 5yrs",
        "JavaScript Graphical Rendering 4yrs",
        "Azure Portal 2yrs",
        "Dedicated SQL Pools 1yr",
        "Redshift 1yr"
      ]
    },
    {
      "name": "Web Development",
      "level": "Lead Developer",
      "keywords": [
        "PHP 9yrs",
        "Java 4yrs",
        "Javascript 9yrs",
        "NodeJS 4yrs",
        "GIT 8yrs",
        "SQL 9yrs",
        "HTML 9yrs",
        "CSS 9yrs",
        "DotCMS 6yrs",
        "GULP 4yrs",
        "NPM/NodeJS 4yrs",
        "Apache Velocity 4yrs",
        "Jenkins 2yrs",
        "Testing 2yrs",
        "Programming Instruction 4yrs",
        "Amazon AWS 6yrs"
      ]
    },
    {
      "name": "Graphic Design",
      "level": "Hobbyist",
      "keywords": [
        "Adobe Photoshop",
        "Adobe Illustrator",
        "GIMP",
        "Python Animation",
        "Sketchup",
        "Blender",
        "Unity3D"
      ]
    },
    {
      "name": "Autocross",
      "level": "Hobbyist",
      "keywords": [
        "DS/STU Class (2017 Golf R)",
        "CS/P3 Class (1988 Porsche 911 Cabriolet)",
        "FS Class (2004 BMW M3)",
        "GS Class (2016 Ford Focus ST)"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": ["Autocross", "Gaming", "Skateboarding"],
  "references": [
    {
      "name": "Brad Rice - Web Graphics Designer at The University of Akron",
      "reference": "Alex is a rare find. He has the ability to quickly prototype applications, then build them out. He has exceptional skills in a number of programming languages, php being his strong suit. But he can use what he knows as a MVC programmer and use it with a variety of languages and frameworks. He also knows front end development with javascript and css.   I would highly recommend Alex to anyone considering employing him. Not only are his skill levels extremely good, he is a great person to work with."
    }
  ]
}