{
  "basics": {
    "name": "Alex Sterling",
    "label": "Developer",
    "picture": "headshotweb.jpg",
    "email": "sterlingalex@gmail.com",
    "phone": "(330) 703 5397",
    "website": "",
    "summary": "Alex enjoys designing and developing high-performance full-featured web applications with an emphasis on following web standards to ensure high quality.  He doesn't mind spanning the entire web stack or learning new languages or technologies to get the job done perfectly.  With 5 years of experience building web applications and skills in PHP, JavaScript, SQL, CSS, HTML5 and more Alex can deliver web solutions.",
    "location": {
      "address": "153 Westgate Ave.",
      "postalCode": "44281",
      "city": "Wadsworth",
      "countryCode": "US",
      "region": ""
    },
    "profiles": [
      {
        "network": "github",
        "username": "fusty",
        "url": "http://github.com/fusty"
      },
      {
        "network": "bitbucket",
        "username": "alex_sterling",
        "url": "http://bitbucket.org/alex_sterling"
      }
    ]
  },
  "work": [
    {
      "company": "University of Akron, Information and Technology Services",
      "position": "Senior Web Developer",
      "website": "http://www.uakron.edu",
      "startDate": "06-02-2013",
      "endDate": "08-14-2015",
      "summary": "As Senior Web Developer Alex was in charge of web application design and development.  All work was deployed on RedHat 6 servers running PHP 5.3 and developed on Ubuntu 12.04 systems.  Extensive experience with build tools allowed him to cover the entire stack (htaccess/folder permissions to front end design) excluding Apache server settings when building applications",
      "highlights": [
        "Mastery of debugging PHP, JavaScript, SQL queries, CSS, HTML, Apache Velocity and more",
        "Mastery of API interfacing (JavaScript, PHP, REST, SOAP etc.)",
        "Extensive use of VI/VIM, SublimeText and PHPStorm",
        "Experience on Linux servers (Ubuntu 12.04 and RedHat 6)",
        "Extensive use of, and preference for, command line tools",
        "Constant use of GIT version control (GitHub and BitBucket via CLI)",
        "Small-Team GIT repository management",
        "2 years of OOP PHP development",
        "Experience following PHP PSRs 0-2",
        "Extensive Laravel 4 development (From small utilities to scalable applications)",
        "2 years of REST server design/implementation experience",
        "Constant use of Composer PHP package manager",
        "Extensive use of build tools (Gulp, CSS/JS Minifcation, CSS Autoprefixing, Markdown parsing etc.)",
        "Constant use of AJAX in applications",
        "Comfort using front-end libraries such as Bootstrap, Foundation, jQuery and jQueryUI/Mobile",
        "IE8+ cross-browser compatibility familiarity",
        "E-Mail cross-client compatibility familiarity",
        "SASS/LESS experience"
      ]
    },
    {
      "company": "Parking and Transportation Services, The University of Akron",
      "position": "Office Assistant",
      "website": "http://www.uakron.edu/parking",
      "startDate": "6-31-2009",
      "endDate": "6-02-2013",
      "summary": "Parking and Transportation Services manages all parking on the University of Akron's main campus.  This includes maintenance and manning of lots during special events on campus.  An office assistant maintains computer based records and systems used to perform the daily operations of the Parking office.  ",
      "highlights": [
        "Daily use of *NIX environments",
        "Maintenance and Development of PHP, Javascript and SQL based web content",
        "Maintenance of server-side Perl scripts",
        "Daily use of SQL console and query syntax",
        "Developed an automated PDF parking permit generator",
        "Distribution of messaging over twitter, facebook, email, listserves and web pages",
        "Creation of internal and public maps, promotions, flyers and posters for electronic and print publications.",
        "Developed an application to reserve shuttle service, invoice said service and notify shuttle coordinators of the requested service"
      ]
    },
    {
      "company": "LMS Surveying LTD.",
      "position": "Office Support",
      "website": "http://www.lmssurveying.com/",
      "startDate": "2-1-2008",
      "endDate": "8-1-2008",
      "summary": "LMS Surveying LTD. is a land surveying company focusing on plotting improvements to property for tax and sales purposes.",
      "highlights": [
        "Build a Microsoft Access database to store job information and organize the field crew",
        "Redesign website (no longer their current website)",
        "Learn AutoCAD drafting process for surface surveys"
      ]
    },
    {
      "company": "Digital Media Center, Johns Hopkins University",
      "position": "Front Desk Worker",
      "website": "http://digitalmedia.jhu.edu/",
      "startDate": "7-1-2006",
      "endDate": "1-31-2008",
      "summary": "The Digital Media Center is an advanced and specialized computer lab and equipment rental/borrowing facility.  The software on the computers ranges from 3D modeling/animation to Photoshop to ProTools.  The equipment facilitated the capture of media to be processed in the Digital Media Center.  A front desk worker would coach the patrons requesting assistance to the best of their ability as well as loaning equipment to patrons and training patrons on their use.",
      "highlights": [
        "Trained and coached college students on a variety of digital media software and projects.  Software included Adobe Creative Suite, Adobe Final Cut, Avid Suite, Microsoft Office, 3DS Max, and Maya 3D",
        "Opened and closed a 20+ station computer lab also specializing in the loaning out of audio-visual capture equipment and training on audio-visual equipment"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "The University of Akron",
      "area": "Computer Science",
      "studyType": "Incomplete Bachelors",
      "startDate": "2010-08",
      "endDate": "2017-08",
      "gpa": "",
      "courses": [
        "Introduction to C++",
        "Computer Science 2 (OOP C++)",
        "Discrete Mathematics",
        "Calculus III"
      ]
    },
    {
      "institution": "Johns Hopkins University",
      "area": "Mechanical Engineering",
      "studyType": "Incomplete Bachelors",
      "startDate": "2006-08",
      "endDate": "2008-01",
      "gpa": "",
      "courses": [
        "Thermodynamics",
        "Calculus II",
        "Statics"
      ]
    }
  ],
  "awards": [],
  "publications": [
    {
      "name": "University of Akron Campus Map",
      "publisher": "University of Akron",
      "releaseDate": "September 2013",
      "website": "http://maps.uakron.edu",
      "summary": "Interactive campus map built on top of Google Maps API.  Includes driving/walking/biking directions, building information, deep-linking of building profiles all with a graphical backend for distributed management."
    },
    {
      "name": "University of Akron Email/Web Publication Tool",
      "publisher": "University of Akron",
      "releaseDate": "February 2015",
      "website": "http://share.uakron.edu/mailAll",
      "summary": "A universal publication and distribution CMS for campus use.  Allows the creation, moderation and distribution of publications organized by articles.  Allows reader submission of articles, custom front-end formatting, and fine-grained permissioning.  The application can scale to an arbitrary number of publications natively."
    },
    {
      "name": "University of Akron Google Search Appliance",
      "publisher": "University of Akron",
      "releaseDate": "June 2015",
      "website": "http://gsa.uakron.edu/",
      "summary": "Heavy XSLT modifications to the GSA so it looks like the rest of uakron.edu sites"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Lead Developer",
      "keywords": [
        "HTML 6yrs",
        "CSS 5yrs",
        "Javascript 5yrs",
        "SQL 6yrs",
        "PHP 5yrs",
        "GULP 2yrs",
        "NPM 2yrs",
        "dotCMS 4yrs",
        "Apache Velocity 2yrs"
      ]
    },
    {
      "name": "Graphic Design",
      "level": "Hobbyist",
      "keywords": [
        "Adobe Photoshop",
        "Adobe Illustrator",
        "GIMP",
        "Python Animation",
        "Sketchup",
        "Blender",
        "Unity3D"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [],
  "references": [
    {
      "name": "Brad Rice - Web Graphics Designer at The University of Akron",
      "reference": "Alex is a rare find. He has the ability to quickly prototype applications, then build them out. He has exceptional skills in a number of programming languages, php being his strong suit. But he can use what he knows as a MVC programmer and use it with a variety of languages and frameworks. He also knows front end development with javascript and css.   I would highly recommend Alex to anyone considering employing him. Not only are his skill levels extremely good, he is a great person to work with."
    }
  ]
}